#Использовать asserts
// #Использовать ".."

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
    ВсеТесты = Новый Массив;    
    ВсеТесты.Добавить("ТестДолжен_ПроверитьЧтоПолученВерныйТекстСообщения");
    
    Возврат ВсеТесты;
КонецФункции

Процедура ПередЗапускомТеста() Экспорт
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры

Процедура ТестДолжен_ПроверитьЧтоПолученВерныйТекстСообщения() Экспорт
    Результат = ПолучитьТекстСообщения();
    Ожидаем.Что(Результат, "Ожидаем, что 'Hello world!'").Равно("Hello world!");
КонецПроцедуры

Функция ПолучитьТекстСообщения()
    Возврат "Hello world!";
КонецФункции
